src/timeline.org
#+TITLE: TimeLine
#+setupfile: ../setup.setup
- /2024-11-23 sat 18:58/ [[../post/其他/游戏/mc/红石学习笔记.org][红石学习笔记]]
- /2024-11-10 sun 09:14/ [[../post/其他/游戏/Terraria/泰拉瑞亚战士全流程笔记.org][泰拉瑞亚战士全流程笔记]]\\
  看404岛主等up的教程学的知识点笔记
- /2024-10-01 02:04/ [[../post/一些工具/Latex/Latex笔记.org][latex学习笔记]]\\
  latex使用过程中查阅一些资料做的笔记，防忘
- /2023-11-24 22:00/ [[../post/学习笔记/python/manim/使用manim制作一个动画.org][使用manim制作一个完整的动画]]\\
  记使用manim制作一个动画的经验或过程
- /2023-11-24 21:00/ [[../post/学习笔记/python/manim/在Termux上安装ArchLinux并安装好Manim.org][在termux上安装archlinux并安装好manim]]\\
  如题，网上资料也忒少了吧
- /2023-08-23 00:47/ [[../post/学习笔记/python/manim/Manim学习笔记.org][manim学习笔记]]\\
  啃manim教程
- /2023-07-29 22:20/ [[../post/学习笔记/语文/语文笔记2.org][语文笔记2]]\\
  内容来自课本和部分教辅材料
- /2023-07-25 17:55/ [[../post/学习笔记/语文/小学笔记汇总.org][小学语文笔记汇总]]\\
  从小学课本上抄下来的
- /2023-07-08 10:01/ [[../post/其他/游戏/unciv/个人游玩经验分享.org][unciv个人游玩经验分享]]\\
  玩这个游戏总算是有一定的时长了，自己也摸索出来了一些比较有趣的打法分享
- /2023-06-08 00:06/ [[../post/学习笔记/计算机学习/从零开始认识计算机.org][从零开始认识计算机]]\\
  内容来自b站up主“硬件茶谈”的视频，请多多支持原视频，本blog仅为学习笔记
- /2023-06-07 11:58/ [[../post/其他/游戏/unciv/Unciv.org][unciv——一款模拟文明游戏]]\\
  一款仿照文明5的文明模拟策略游戏
- /2023-05-26 14:28/ [[../post/学习笔记/C语言学习/C语言入门.org][c语言入门]]\\
  自己尝试写的c语言教程（未完成）
- /2023-04-29 08:55/ [[../post/关于建站/使用github.io建立自己的博客.org][用github.io建立自己的博客]]\\
  分别使用hexo、hugo、emacs org建立自己的博客。
- /2023-04-07 11:09/ [[../post/学习笔记/道法/八下早读材料.org][八下道法背诵材料]]\\
  我的道法笔记
- /2023-03-04 11:20/ [[../post/一些工具/Emacs/Emacs学习笔记.org][emacs学习笔记]]\\
  我自己尝试写的emacs入门教程，不喜勿喷，持续更新中
- /2023-01-18 18:22/ [[../post/学习笔记/C语言学习/打印字符使用特殊效果.org][打印字符使用特殊效果]]\\
  使用ansi转义字符实现终端输出字符带有特殊效果
- /2023-01-16 12:30/ [[../post/一些工具/Emacs/从vim转移到emacs.org][从vim转移到emacs]]\\
  单纯的有感而发的口水文
- /2023-01-08 08:17/ [[../post/学习笔记/语文/语文笔记.org][语文笔记]]\\
  内容来自b站的视频，笔记是我自己写的
- /2022-12-02 18:42/ [[../post/一些工具/我用的小工具盘点.org][一些我用的软件清单]]\\
  记录一些linux中有趣但不一定常用的软件
- /2022-11-26 22:47/ [[../post/ArchLinux学习系列/Archiso——打造属于你的在U盘上的Archlinux Live系统.org][archiso——打造属于你的在u盘上的archlinux live系统]]\\
  如何使用archiso工具打造一个自定义的u盘上的临时live系统
- /2022-08-04 11:00/ [[../post/关于建站/用github.io建立一个自己的博客网站.org][用github.io+jekyll建立一个自己的博客网站]]\\
  使用github.io+jekyll建立自己的博客网站
- /2022-07-08 22:57/ [[../post/一些工具/Vim/使用Vim.org][使用vim/neovim]]
- /2022-07-03 22:56/ [[../post/ArchLinux学习系列/ArchLinux的配置.org][我的archlinux的配置]]\\
  记录我个人的archlinux软件配置
- /2022-07-02 22:56/ [[../post/ArchLinux学习系列/ArchLinux的安装.org][archlinux的安装]]\\
  记录我个人安装archlinux的过程
