src/timeline.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<!-- 2025-01-23 四 11:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TimeLine</title>
<meta name="author" content="不要在意我的头像QwQ" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/theme/main.css"/>
<link rel="shortcut icon" href="/img/icon.jpg">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">TimeLine</h1>
<ul class="org-ul">
<li><i>2024-11-23 sat 18:58</i> <a href="../post/其他/游戏/mc/红石学习笔记.html">红石学习笔记</a></li>
<li><i>2024-11-10 sun 09:14</i> <a href="../post/其他/游戏/Terraria/泰拉瑞亚战士全流程笔记.html">泰拉瑞亚战士全流程笔记</a><br />
看404岛主等up的教程学的知识点笔记</li>
<li><i>2024-10-01 02:04</i> <a href="../post/一些工具/Latex/Latex笔记.html">latex学习笔记</a><br />
latex使用过程中查阅一些资料做的笔记，防忘</li>
<li><i>2023-11-24 22:00</i> <a href="../post/学习笔记/python/manim/使用manim制作一个动画.html">使用manim制作一个完整的动画</a><br />
记使用manim制作一个动画的经验或过程</li>
<li><i>2023-11-24 21:00</i> <a href="../post/学习笔记/python/manim/在Termux上安装ArchLinux并安装好Manim.html">在termux上安装archlinux并安装好manim</a><br />
如题，网上资料也忒少了吧</li>
<li><i>2023-08-23 00:47</i> <a href="../post/学习笔记/python/manim/Manim学习笔记.html">manim学习笔记</a><br />
啃manim教程</li>
<li><i>2023-07-29 22:20</i> <a href="../post/学习笔记/语文/语文笔记2.html">语文笔记2</a><br />
内容来自课本和部分教辅材料</li>
<li><i>2023-07-25 17:55</i> <a href="../post/学习笔记/语文/小学笔记汇总.html">小学语文笔记汇总</a><br />
从小学课本上抄下来的</li>
<li><i>2023-07-08 10:01</i> <a href="../post/其他/游戏/unciv/个人游玩经验分享.html">unciv个人游玩经验分享</a><br />
玩这个游戏总算是有一定的时长了，自己也摸索出来了一些比较有趣的打法分享</li>
<li><i>2023-06-08 00:06</i> <a href="../post/学习笔记/计算机学习/从零开始认识计算机.html">从零开始认识计算机</a><br />
内容来自b站up主“硬件茶谈”的视频，请多多支持原视频，本blog仅为学习笔记</li>
<li><i>2023-06-07 11:58</i> <a href="../post/其他/游戏/unciv/Unciv.html">unciv——一款模拟文明游戏</a><br />
一款仿照文明5的文明模拟策略游戏</li>
<li><i>2023-05-26 14:28</i> <a href="../post/学习笔记/C语言学习/C语言入门.html">c语言入门</a><br />
自己尝试写的c语言教程（未完成）</li>
<li><i>2023-04-29 08:55</i> <a href="../post/关于建站/使用github.io建立自己的博客.html">用github.io建立自己的博客</a><br />
分别使用hexo、hugo、emacs org建立自己的博客。</li>
<li><i>2023-04-07 11:09</i> <a href="../post/学习笔记/道法/八下早读材料.html">八下道法背诵材料</a><br />
我的道法笔记</li>
<li><i>2023-03-04 11:20</i> <a href="../post/一些工具/Emacs/Emacs学习笔记.html">emacs学习笔记</a><br />
我自己尝试写的emacs入门教程，不喜勿喷，持续更新中</li>
<li><i>2023-01-18 18:22</i> <a href="../post/学习笔记/C语言学习/打印字符使用特殊效果.html">打印字符使用特殊效果</a><br />
使用ansi转义字符实现终端输出字符带有特殊效果</li>
<li><i>2023-01-16 12:30</i> <a href="../post/一些工具/Emacs/从vim转移到emacs.html">从vim转移到emacs</a><br />
单纯的有感而发的口水文</li>
<li><i>2023-01-08 08:17</i> <a href="../post/学习笔记/语文/语文笔记.html">语文笔记</a><br />
内容来自b站的视频，笔记是我自己写的</li>
<li><i>2022-12-02 18:42</i> <a href="../post/一些工具/我用的小工具盘点.html">一些我用的软件清单</a><br />
记录一些linux中有趣但不一定常用的软件</li>
<li><i>2022-11-26 22:47</i> <a href="../post/ArchLinux学习系列/Archiso——打造属于你的在U盘上的Archlinux Live系统.html">archiso——打造属于你的在u盘上的archlinux live系统</a><br />
如何使用archiso工具打造一个自定义的u盘上的临时live系统</li>
<li><i>2022-08-04 11:00</i> <a href="../post/关于建站/用github.io建立一个自己的博客网站.html">用github.io+jekyll建立一个自己的博客网站</a><br />
使用github.io+jekyll建立自己的博客网站</li>
<li><i>2022-07-08 22:57</i> <a href="../post/一些工具/Vim/使用Vim.html">使用vim/neovim</a></li>
<li><i>2022-07-03 22:56</i> <a href="../post/ArchLinux学习系列/ArchLinux的配置.html">我的archlinux的配置</a><br />
记录我个人的archlinux软件配置</li>
<li><i>2022-07-02 22:56</i> <a href="../post/ArchLinux学习系列/ArchLinux的安装.html">archlinux的安装</a><br />
记录我个人安装archlinux的过程</li>
</ul>
</div>
<div id="postamble" class="status">
<p class="author">Author: 不要在意我的头像QwQ</p>
<p class="date">Created: 2025-01-23 四 11:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
